app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"